{
  "validations": {
    "required": "Required",
    "email_address": "Invalid email address or phone number",
    "min_length_5": "Minimal 8 characters",
    "digit": "Only contains digits",
    "upcLength": "Length must be 8, 12, 13, 14, 17",
    "max_length_18": "Maximal 15 characters"
  },
  "formCommon": {
    "submit": "Submit",
    "edit": "Edit",
    "save": "Save",
    "create": "Create",
    "clear": "Clear",
    "delete": "Delete",
    "cancel": "Cancel",
    "submit_success_message": "Submit success",
    "update_success": "Update successfull",
    "email_or_phone": "Email or Phone Number",
    "password": "Password",
    "change_password_success": "Your password has been successfully changed.",
    "monthOptions": {
      "1": "January",
      "2": "February",
      "3": "March",
      "4": "April",
      "5": "May",
      "6": "June",
      "7": "July",
      "8": "August",
      "9": "September",
      "10": "October",
      "11": "November",
      "12": "December"
    }
  },
  "menu": {
    "company_name": "12u12",
    "dashboard": "Dashboard",
    "separator": "-------------------",
    "account": "Profile",
    "section_my_data": "My Data",
    "section_tools_settings": "Tools & Settings",
    "input": "Input",
    "edit": "Edit",
    "view_summary": "View Summary",
    "analyze": "Analyze",
    "section_my_recipes": "My Recipes",
    "create": "Create",
    "manage_and_edit": "Manage and Edit",
    "profile": "Profile",
    "change_password": "Change Password",
    "add_sub_user": "Add Sub User",
    "settings": "Settings",
    "logout": "Logout",
    "body_map": "Body Map",
    "meal_planner": "Create Plan",
    "meal_plan_summary": "Summary",
    "meal_plan_title": "Meal Plan",
    "forum_title": "Forum_title",
    "forum": "Forum"
  },
  "home": {
    "welcome": "Welcome to 12u12",
    "not_a_member": "Not a member?",
    "sign_up_now": "Sign up now",
    "keep_login": "Keep me logged in",
    "forgot_password": "Forgot password?",
    "login": "Login",
    "login_success": "Login success"
  },
  "forgot": {
    "title": "Enter Email or Phone Number to reset the password",
    "step2title": "Enter New Password",
    "checkmail": "The password recovery link was sent to your email. Please Click it"
  },
  "reset": {
    "title": "New password",
    "old_password_title": "Old Password",
    "old_password": "Old Password",
    "new_password": "New Password",
    "new_password_confirm": "Confirm New Password",
    "password_confirm_not_match": "Password and Confirmation is not match"
  },
  "signUp": {
    "title": "Sign Up",
    "register_success": "activation link has been sent to your email you.",
    "password_confirm_not_match": "Password and Confirmation is not match",
    "firstname": "Firstname",
    "lastname": "Lastname",
    "email_or_phone": "Email or Phone number",
    "password": "Password",
    "password_confirm": "Confirm Password",
    "month": "Month",
    "year": "Year",
    "gender": "Gender",
    "address": "Location",
    "ethnicity": "Ethnicity",
    "captcha_required": "Captcha required!",
    "agreement_label": "By clicking on the checkbox, you agree to 12u12 ",
    "agreement_link": "Terms of Use",
    "agreement_link_2": "Privacy Policy",
    "already_have_account": "Already have an account ? ",
    "login_here": "Login Here"
  },
  "profile": {
    "PAGE_TITLE": "Profile",
    "title": "User Profile",
    "profile_update_title": "Update User Profile",
    "sub_user_create_title": "Add Sub User",
    "fullname": "Fullname",
    "firstname": "Firstname",
    "lastname": "Lastname",
    "email_or_phone": "Email or Phone number",
    "password": "Password",
    "password_confirm": "Confirm Password",
    "month": "Month",
    "year": "Year",
    "gender": "Gender",
    "address": "Location",
    "ethnicity": "Ethnicity",
    "update_profile": "Edit",
    "update_form_title": "Update",
    "new_subuser_title": "Add New Subuser"
  },
  "stocks": {
    "PAGE_TITLE": "Data Summary",
    "symptoms": "Symptoms",
    "symptom": "symptom",
    "done": "Save",
    "plot": "Plot",
    "cancel": "Cancel"
  },
  "symptoms": {
    "PAGE_TITLE": "Input Data",
    "ENTERED_TITLE": "Entered Item",
    "CATEGORY_TEXT": "Select Category",
    "ITEM_INPUT_TEXT": "Enter Item Name",
    "ITEM_INPUT_TEXT_SYMPTOM": "Enter Symptom",
    "ITEM_VALUE_TEXT_SYMPTOM": "Severity",
    "ITEM_UNIT_TEXT": "Unit",
    "TIME_TEXT": "Occurence Time",
    "DATE_TEXT": "Today",
    "SAVED": "Saved Successfully",
    "NO_USER_SELECTED_ERROR_TEXT": "please select user/s",
    "NO_CATEGORY_ERROR_TEXT": "Please select a category",
    "NO_ITEM_NAME_ERROR_TEXT": "Please select an item",
    "NO_SCALE_ERROR_TEXT": "Please select a scale",
    "FROM_DATE_TEXT": "From",
    "TO_DATE_TEXT": "To",
    "NO_DATE_ERROR_TEXT": "Please select a date value to edit",
    "DELETE_PROMPT_TEXT": "Are you sure you want to delete that record?",
    "UPDATE_PROMPT_TEXT": "Are you sure you want to update that record?",
    "CONFIRM_TEXT": "Yes",
    "CANCEL_TEXT": "No",
    "DUPLICATE_ENTRY_ERROR_TEXT": "This entry is already on the list",
    "OTHER_ENTRY_ERROR_TEXT": "Item not in 12u12 database. For better data analysis, click Cancel to edit or select from suggested list. Otherwise, click Yes to accept current entry",
    "CLEAR_PROMPT_TEXT": "All unsaved data will be lost. Are you sure you want to clear the page?",
    "CLEAR_PAGE_TITLE": "Unsaved Entry",
    "DUPLICATE_ENTRY_TITLE": "Duplicate Entry"
  },
  "editsymptoms": {
    "PAGE_TITLE": "Edit Data"
  },
  "graph": {
    "PAGE_TITLE": "Analyze Data"
  },
  "products": {
    "PAGE_TITLE": "Contribute Data",
    "PRODUCT_DEFAULT_TEXT": "Product Name",
    "CATEGORY_DEFAULT_TEXT": "Category",
    "UPC_DEFAULT_TEXT": "Barcode",
    "BRAND_DEFAULT_TEXT": "Brand",
    "COMMENT_DEFAULT_TEXT": "Comment (optional)",
    "INGREDIENT_DEFAULT_TEXT": "Ingredient",
    "INGREDIENTS_LABEL_DEFAULT_TEXT": "Entered Ingredients:",
    "INGREDIENTS_EMPTY": "None added yet (at least 1 ingredient item)",
    "AMOUNT_DEFAULT_TEXT": "Amount (optional)",
    "UNIT_DEFAULT_TEXT": "Unit (optional)",
    "ADD_BUTTON_VALUE": "Add Ingredient",
    "SAVE_BUTTON_VALUE": "Save Product",
    "CLEAR_BUTTON_VALUE": "Clear Page",
    "UPDATE_BUTTON_VALUE": "Update Ingredient",
    "DELETE_BUTTON_VALUE": "Delete Ingredient",
    "WARN_REPLACE": "An ingredient with that name already exists. Would you like to replace it?",
    "CHOICE_YES": "Yes",
    "CHOICE_NO": "No",
    "PERMISSION_REPLACE": "Are you sure you want to replace current selected item’s values?",
    "PERMISSION_DELETE": "Are you sure you want to delete the selected item?",
    "PERMISSION_SUBMIT": "Are you sure you want to submit all values?",
    "PERMISSION_CLEAR": "Are you sure you want to clear all?",
    "SEND_SUCCESS_TEXT": "Data inputted was sent successfully",
    "UPC_EXIST": "This product is already in our database.  Thank you.",
    "DUPLICATE_ENTRY_TITLE": "Duplicate Entry"
  },
  "agreement": {
    "TITLE": "12U12 Sdn. Bhd.Terms of Use Agreement",
    "LEAD": "PLEASE READ THE TERMS AND CONDITIONS OF USE BELOW BEFORE USING THIS SITE.",
    "UNDERSTAND": "I understand",
    "MSG_1": "By using this site, you signify your assent to these Terms and Conditions. If you do not agree to all of these Terms and Conditions, do not use this site.",
    "MSG_2": "12u12 Sdn.Bhd.(12u12) may revise and update these Terms and Conditions at any time. Your continued usage of the 12u12 website and apps (12u12 Site, or the Site,) will mean you accept those changes.",
    "MSG_3_TITLE": "MEDICAL ADVICE DISCLAIMER",
    "MSG_3": "12u12provides  the  Site  and  the  services,  information,  content,and/or  data  (collectively, “Information”) contained therein for informational purposes only. The Information is  not intended  to  be  a  substitute  for  professional  medical  advice,  diagnosis,  or  treatment.  Always seek  the  advice  of  your  physician  or  other  qualified  health  provider  with  any  questions  you may have regarding a medical condition. Never disregard professional medical advice or delay in seeking it because of something you have read on the 12u12 Site.",
    "MSG_4": "Using, accessing,and/or browsing the Site and/or providing personal or medical information to 12u12does  not  create  a  physician-patient  relationship  between  you  and 12u12.  Nothing contained  in  the  Site  is  intended  to  create  a  physician-patient  relationship,  to  replace  the services of a licensed, trained physician or health professional,or to be a substitute for medical advice of a physician or trained health professional licensed in your country.You hereby agree that  you  shall  not  make  any  medical or  health-related  decision  based  in  whole  or in  part  on anything contained in the Site.",
    "MSG_5": "If you think you may have a medical emergency, call your doctor or local emergency agencies immediately. 12u12 does not recommend or endorse any specific tests, physicians, products, procedures, opinions,or other information that may be mentioned on the Site. Reliance on any information provided by 12u12, 12u12 employees, others appearing on the Site at the invitation of 12u12,or other visitors to the Site is solely at your own risk.",
    "MSG_6_TITLE": "CHILDREN",
    "MSG_7": "We are committed to protecting the privacy of children. You should be aware that this Site is not intended for nor designed to invitechildren under the age of 18. We do not collect personally identifiable information from any person we know is a child under the age of 18. A parent or guardian, however, may use 12u12 to record activities and symptoms for a minor. The parent or guardian alone isresponsible for providing supervision of the minor's use of 12u12. The parent or guardian assumes full responsibility for ensuring that the registration information is kept secure and that the information submitted is accurate. The parent or guardian also assumes full responsibility for the interpretation and use of any information or suggestions provided through 12u12 for the minor.",
    "MSG_8_TITLE": "PASSWORDS",
    "MSG_9": "12u12has several tools that allow you to record and store information. You are responsible for taking  all  reasonable  steps  to  ensure  that  no  unauthorized  person  shall  have  access  to  your 12u12passwords or accounts. It is solely your responsibility to (1) control the dissemination and use of your sign-in name, screen name,and passwords; (2) authorize, monitor,and control access  to  and  use  of  your 12u12account  and  password;  (3)  promptly  inform 12u12if  you believe your account or password has been compromisedor if there is any other reason  you need to deactivate a password by sending us an email atContact@12u12.com. You grant 12u12and  all  other  persons  or  entities  involved  in  the  operation  of  the  Site  the  right  to  transmit, monitor, retrieve, store,and useyour information in connection with the operation of the Site. 12u12cannot  and  does  not  assume  any  responsibility  or  liability  for  any  information  you submit  or  your  or  third  parties'  use  or  misuse  of  information  transmitted  or  received  using 12u12toolsand services.",
    "MSG_10_TITLE": "THIRD PARTY LINKS AND ADVERTISEMENTS DISCLAIMER",
    "MSG_11": "The Site may, from time to time, contain links to third party websites. These links are provided solely as a convenience to you and not as a guarantee, warranty,or recommendation by 12u12of  the  services,  information,  content,and/or  data  on  such  third-party  websites  or  as  an indication of any affiliation, sponsorship,or endorsement of such third-party websites. 12u12is  not  responsible  for  the  content  of  linked  third  party  websites  and  does  not  make  any representations or warranties regarding the privacy practices of, or the content or accuracy of materials on, such third-party websites. If you decide to access linkedthird-party websites, you do so at your own risk. Your use of third-party websites is subject to the terms of use for such sites.",
    "MSG_12_TITLE": "LIABILITY OF 12U12AND ITS LICENSORS",
    "MSG_13": "Use of the 12u12Site and associatedInformation is at your own risk.",
    "MSG_14": "When using the 12u12Site, information will be transmitted over a medium that may be beyond the control and jurisdiction of 12u12and its suppliers. Accordingly, 12u12assumes no liability for or relating to the delay, failure, interruption,or corruption of any data or other information transmitted in connection with use of the 12u12Site.",
    "MSG_15": "The 12u12Site and the content are provided on an (as is) basis. 12u12, ITS LICENSORS, AND ITS SUPPLIERS, TO THE FULLEST EXTENT PERMITTED BY LAW, DISCLAIM ALL WARRANTIES, EITHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT OF THIRD PARTIES' RIGHTS,AND FITNESS FOR PARTICULAR PURPOSE.",
    "MSG_16": "Without limiting the foregoing, 12u12, its licensors,and its suppliers make no representations or warranties about the following:"
  },
  "privacy": {
    "TITLE": "12U12 SDN. BHD.PRIVACY POLICY",
    "UNDERSTAND": "I understand",
    "MSG_1": "12u12  understands  how  important  the  privacy  of  personal  information  is  to  our  users.  This Privacy Policy will tell you what information we collect about you and about your use of 12u12 and its services. It will explain the choices you have about how your personal information is used and how we protect that information. We urge you to read this Privacy Policy carefully.",
    "MSG_2": "This Privacy Policy applies to the website owned and operated by 12u12 that is intended for non-commercial, non-professional,personaluse by consumers, including the mobile optimized versions of thissite and our Mobile Device Application or Apps (we refer to this site in all its manifestationsand  Appscollectively as the “12u12 Sites”). We refer to the 12u12 Sites, along with the information and services made available to you through the 12u12 Sites, as the “Services.”",
    "MSG_3": "If  you  do  not  want  us  to  collect,  use  or  disclose  information  about  you  and  your  use  of  the Services as described in this Privacy Policy, then you should not use the Services. By using the Services,  you  must  agree  to  the  12u12  Terms and  Conditions of use,  which  is  the  contract between 12u12and users of the Services. By accepting the 12u12 Terms and Conditions of use, you confirm that you have read and understand this Privacy Policy and the 12u12 cookie policy.",
    "MSG_4": "References to 12u12, “we,” or “us” mean 12u12 Sdn. Bhd. Except as otherwise noted in this Privacy Policy, 12u12 Sdn. Bhd. is the data controller responsible for the processing of your personal information as described in this Privacy Policy.",
    "MSG_5_TITLE": "INFORMATION COLLECTED ABOUT YOU",
    "MSG_6": "12u12 storesyour personal information in accordance with this Privacy Policy. When you use our Services, we collect information as follows:",
    "MSG_7_TITLE": "Registration",
    "MSG_8": "Access to all our servicesrequiresregistration. At registration, you will be required to provide certain personal informationsuch as your gender, email address, ethnicity, month/year of birth, and city of residence, as well as create a username and password to access your 12u12 account. You may use fake names but you are responsible for ensuring the accuracy of other personal information that you submit to 12u12, some which may be necessary to improve the relevancy of feedback or information from 12u12 to you.",
    "MSG_9_TITLE": "General Service",
    "MSG_10": "Our Service is mostly interactive andwill request that you submit health-related informationsuch  as  factors  you  are  exposed  to  and  symptoms  you  have  experienced,  along  with  other information to help us analyze if there is a trend between the factors and the symptoms.",
    "MSG_11": "12u12 provides you with a secure place to gather, store, and manage your personal informationas well as share the information with your health or personal care providers if you choose to do so.",
    "MSG_12": "12u12 also provides you with tools and services in one place to better manage your health by uploading data relatedto your vital signs and physical activities from other tracking devices.",
    "MSG_13_TITLE": "Emails and Marketing",
    "MSG_14": "At registration and at various times as you use the 12u12 Sites, we will leveragethe information you  have  entered  and  stored  in  our  system  to  share  with  you  informational/promotional newsletters,such asnewslettersrelating to a specific health condition. From time to time 12u12 may offer users of third-party websites the opportunity to subscribe to our newsletters through those websites. If you elect to subscribe to one of our newsletters on a third-party website, the operator  of  that  website  will  provide  us with  the  personal  information  you  have  provided  in connection with the subscription request, which we may use in accordance with this Privacy Policy as though you had provided it directly to 12u12.12u12 may use any information that you submit in connection withyour12u12 account to deliver any advertisements to you on or off of the 12u12 Sites."
  },
  "recipe": {
    "PAGE_TITLE": "Create My Recipe",
    "RECIPE_NAME_DEFAULT_TEXT": "Recipe Name",
    "CUISINE_DROPDOWN_PLACEHOLDER": "Cuisine",
    "CUISINE_DROPDOWN_VALUE_OTHER": "Other",
    "SERVING_DROPDOWN_PLACEHOLDER": "Serving",
    "INGREDIENTS_LIST_DEFAULT_TEXT": "Entered Ingredients:",
    "INGREDIENT_FIELD_DEFAULT_TEXT": "Ingredient",
    "INGREDIENTS_EMPTY": "None added yet (at least 2 ingredient items)",
    "MEASUREMENT_DROPDOWN_PLACEHOLDER": "Unit",
    "UNIT_FIELD_DEFAULT_TEXT": "Amount",
    "BRAND_FIELD_DEFAULT_TEXT": "Brand (optional)",
    "COMMENT_FIELD_DEFAULT_TEXT": "Comment (optional)",
    "ADD_INGREDIENT_BUTTON_NAME": "Add\n Ingredient",
    "UPDATE_INGREDIENT_BUTTON_NAME": "Update Ingredient",
    "DELETE_INGREDIENT_BUTTON_NAME": "Delete Ingredient",
    "SAVE_RECIPE_BUTTON_NAME": "Save Recipe",
    "CLEAR_RECIPE_BUTTON_NAME": "Clear Recipe",
    "PROMPT_INGREDIENT_NOT_IN_DB_WARNING": "This ingredient is not in our database. Its nutritional values will not be included in the total nutritional value estimate.",
    "PROMPT_UPDATE_RECIPE": "Do you want to replace the existing recipe?",
    "CLEAR_QUESTION_RECIPE": "All unsaved data will be lost. Are you sure you want to clear all entries?",
    "RESET_TO_NEW_RECIPE_QUESTION": "You have not saved your changes, are you sure you want to go to create recipe page?",
    "CLEAR_RECIPE_TITLE": "Unsaved Entry",
    "DELETE_INGREDIENT_TITLE": "Delete Confirmation",
    "DELETE_PROMPT_TEXT": "Are you sure you want to delete this ingredient?"
  },
  "recipe_management": {
    "PAGE_TITLE": "Manage Recipe",
    "SEARCH_FIELD_PLACEHOLDER": "Search",
    "SORT_DROPDOWN_PLACEHOLDER": "Sort By",
    "SORT_DROPDOWN_LABEL_NAME": "Name",
    "SORT_DROPDOWN_LABEL_RANK": "Rank",
    "SORT_DROPDOWN_LABEL_RATE": "Star",
    "SORT_DROPDOWN_LABEL_DATE": "Date Created",
    "INGREDIENT_ITEM_RANK_LABEL": "Rank",
    "DELETE_RECIPE_BUTTON_NAME": "Delete",
    "CREATE_MEAL_PLAN_BUTTON_NAME": "Create Meal Plan",
    "EDIT_RECIPE_BUTTON_NAME": "Edit"
  },
  "account": {
    "PAGE_TITLE": "Account"
  },
  "meal_planner": {
    "PAGE_TITLE": "Meal Planner",
    "DATE_TEXT": "Date",
    "SELECT_MEAL_TEXT": "Select Meal",
    "DELETE_ITEM_TITLE": "Delete Confirmation",
    "DELETE_PROMPT_TEXT": "Are you sure you want to delete this entry?",
    "SAVE_SUCCESSFULLY_TITLE": "Saved Successfully",
    "SAVE_SUCCESSFULLY_TEXT": "Your entry has been saved to the 12u12 database",
    "SAVE_PAGE_TITLE": "Unsaved Entry",
    "SAVE_PAGE_UNSAVED_DATA_ERROR_TEXT": "You have not added your last item to the list. Do you want to save your data without this item?",
    "SAVE_UNSUCCESSFULLY_TITLE": "Unsuccessful",
    "SAVE_UNSUCCESSFULLY_TEXT": "Please try again",
    "ITEM_NAME_TEXT": "Add Item Name",
    "DUPLICATE_ENTRY_TITLE": "Duplicate Entry",
    "DUPLICATE_ENTRY_ERROR_TEXT": "This entry is already on the list"
  },
  "meal_plan_summary": {
    "PAGE_TITLE": "Meal Plan Summary",
    "TIME_TITLE": "View Week",
    "SAVE_BUTTON": "Save Plan",
    "UPDATE_BUTTON": "Update Plan "
  },
  "forum": {
    "PAGE_TITLE": "Share Experiece",
    "PAGE_TITLE_ME": "My Experiece",
    "PAGE_TITLE_ARCHIVE": "Archived Experience",
    "PAGE_TITLE_USER": "Experiences",
    "MY_POSTS_TITLE": "My Posts",
    "ARCHIVE_TITLE": "Archive",
    "COMMUNITY_PAGE": "Community Page",
    "SYMPTOMS_LIST_LABEL": "Select a Symptom",
    "SORTBY_LABEL": "Sort By",
    "SEARCH_KEYWORD_LABEL": "Search Keywords",
    "RELEVANT_FAILED_TITLE": "Notice",
    "RELEVANT_FAILED_MESSAGE": "You already voted!"
  }
}
